ETL/Documents/УстановкаСоответствий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>УстановкаСоответствий</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ИсторияУстановкиСоответствий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>База</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Базы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаполнения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыПодбораЭталонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЭталона</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыЭталонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаИсточникДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураТаблицSQL</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Соответствия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГУИДСправочника</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>База</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Базы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЭталона</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ТипыЭталонов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Удалить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДопИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Реквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитЭталона</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.РеквизитыЭталонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитЗапроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поиск</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

ETL/Catalogs/СпособыПодбораЭталонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>СпособыПодбораЭталонов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаИсточникДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураТаблицSQL</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЭталона</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыЭталонов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоРегламенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоУмолчанию</Name>
					<Comment>По умолчанию (для данного эталона)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДляЗагрузкиДанных</Name>
					<Comment>Использовать для загрузки данных</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктураПолей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РеквизитЭталона</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.РеквизитыЭталонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеПредставление</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поиск</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПараметра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПоля</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыПолейSQL</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПравилаУстановкиЗначений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЭталона</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ТипыЭталонов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаПравил</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РегламентныеДействия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыПодбораЭталонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/Documents/УстановкаСоответствий/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПриУстановкеСпособаЗаполнения();	
		
	Период.ДатаНачала = Объект.НачалоПериода;
	Период.ДатаОкончания = Объект.КонецПериода; 
	
	ЗаполнитьФлагЭталонПоУмолчанию();
	
	УстановитьЗаголовкиКолонок();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БазаПриИзменении(Элемент)
	УстановитьПараметры();
КонецПроцедуры

&НаКлиенте
Процедура ТипЭталонаПриИзменении(Элемент)
	
	ТипЭталонаПриИзмененииНаСервере();
	УстановитьВидимость();
	УстановитьПараметры();
	УстановитьЗаголовкиКолонок();
	
КонецПроцедуры


&НаКлиенте
Процедура ПериодВариантПриИзменении(Элемент)
	ИзменитьПериод();
КонецПроцедуры

&НаКлиенте
Процедура СпособЗаполненияПриИзменении(Элемент) 
	УстановитьЗаголовкиКолонок();
	СпособЗаполненияПриИзмененииНаСервере(); 
	УстановитьВидимость(); 
	УстановитьПараметры();

КонецПроцедуры

&НаКлиенте
Процедура ПолучатьДопИнформациюПриИзменении(Элемент)
	УстановитьВидимость(); 
	ПолучитьДанныеПоТекущейСтроке();
КонецПроцедуры      

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ИзменитьПериод(); 
	УстановитьПараметры();
		
КонецПроцедуры

&НаКлиенте
Процедура СпособЗаполненияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	Если ВыбранСпособЗаполненияПланаСчетов(ВыбранноеЗначение) Тогда
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Для плана счетов установка соответствия выполняется через документа ""Установка соответствия счетов""");
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЭталонаОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)

	Если ВыбранПланСчетов(ВыбранноеЗначение) Тогда
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю("Для плана счетов установка соответствия выполняется через документа ""Установка соответствия счетов""");
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСоответствия

&НаКлиенте
Процедура СоответствияПриАктивизацииСтроки(Элемент)
	УстановитьОтбор();
	ПолучитьДанныеПоТекущейСтроке();	
		
КонецПроцедуры

&НаКлиенте
Процедура СоответствияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	ТекущиеДанные = Элементы.Соответствия.ТекущиеДанные;

	Если ТекущиеДанные.Статус = "Утвержден" Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;      
	
	
	Если НоваяСтрока Тогда		
		ТекущиеДанные.КлючСвязи = ОбщегоНазначенияКлиентСервер.НовыйКлючСвязиСтрокиТаблицы(Объект.Соответствия);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоответствияЗначениеЭталонаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если РаботаСЭталонамиВызовСервера.ЕстьЭлементыНижнегоУровня(ВыбранноеЗначение) Тогда 
		Сообщить("У выбранного эталона существуют элементы нижнего уровня. Необходимо выбирать элементы нижнего уровня. Выбор отменен.");
   		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	Если Элементы.Соответствия.ТекущиеДанные.ЗначениеЭталона <> ВыбранноеЗначение Тогда       
		Элементы.Соответствия.ТекущиеДанные.Статус = "Выбран";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоответствияПередУдалением(Элемент, Отказ)
	
	МассивКлючей = Новый Массив;
	Для каждого ВыделеннаяСтрока из Элемент.ВыделенныеСтроки Цикл
		
		МассивКлючей.Добавить(Элементы.Соответствия.ДанныеСтроки(ВыделеннаяСтрока).КлючСвязи);
	КонецЦикла;
	
	Для Каждого Ключ из МассивКлючей Цикл
		ОбщегоНазначенияКлиентСервер.УдалитьСтрокиТаблицы(Ключ, Объект.ДопИнформация);
	КонецЦикла;
   	
КонецПроцедуры

&НаКлиенте
Процедура СоответствияЗначениеЭталонаПриИзменении(Элемент)
  	Если Не ЗначениеЗаполнено(Элементы.Соответствия.ТекущиеДанные.ЗначениеЭталона) Тогда       
		Элементы.Соответствия.ТекущиеДанные.Статус = "Не выбран"; 
	Иначе
		Если ТипЗнч(Элементы.Соответствия.ТекущиеДанные.ЗначениеЭталона) = Тип("СправочникСсылка.ЗначенияЭталонов") Тогда
			Элементы.Соответствия.ТекущиеДанные.ЭталонПоУмолчанию = ПолучитьРеквизит(Элементы.Соответствия.ТекущиеДанные.ЗначениеЭталона, "ЭталонПоУмолчанию");
		Иначе 
			Элементы.Соответствия.ТекущиеДанные.ЭталонПоУмолчанию = Ложь;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоответствияПриАктивизацииЯчейки(Элемент)
	ТекущиеДанные = Элементы.Соответствия.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если НЕ ТекущиеДанные.РучноеРедактирование И ТекущиеДанные.Статус = "Утвержден" И НЕ Элемент.ТекущийЭлемент.Имя = "СоответствияРучноеРедактирование" Тогда
			Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина;
		Иначе                                              
			Элемент.ТекущийЭлемент.ТолькоПросмотр = Ложь; 		
		КонецЕсли;  
		
		Если Элемент.ТекущийЭлемент.Имя = "СоответствияСтатус" Тогда
			Если ТекущиеДанные.РучноеРедактирование Тогда
				Элемент.ТекущийЭлемент.ТолькоПросмотр = Ложь; 		
			Иначе
				Элемент.ТекущийЭлемент.ТолькоПросмотр = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоответствияУдалитьПриИзменении(Элемент)
	ТекСтрока = Элементы.Соответствия.ТекущиеДанные;
	Если ТекСтрока.Удалить Тогда
		ПараметрыВопроса = Новый Структура;
		ПараметрыВопроса.Вставить("СтрокаДокумента", ТекСтрока);
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбУдалении", ЭтотОбъект, ПараметрыВопроса);
		ПоказатьВопрос(Оповещение, "Вы уверены, что хотите удалить данное соответствие?", Режим, 0);
		//...	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоответствияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)  //++ 31.03.2025 Муравьев Д.О.

	Отказ = Истина;
	ЗапросSQL = ПолучитьЗапросSQL();	
	ПоляЗапроса = ПолучитьПоляЗапроса();
	
	ПараметрыФормы = новый Структура("ЗапросSQL, ПоляЗапроса", ЗапросSQL, ПоляЗапроса);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормыВыбораСтрок", ЭтотОбъект); 
	ОткрытьФорму("Документ.УстановкаСоответствий.Форма.Форма", ПараметрыФормы,ЭтотОбъект,,,,ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура СоответствияПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) //++ 08.04.2025 Муравьев Д.О.
	Отказ = Истина;
	ЗапросSQL = ПолучитьЗапросSQL();	
	ПоляЗапроса = ПолучитьПоляЗапроса();
	ВыборОднойСтроки = Истина;
	
	
	ПараметрыФормы = новый Структура("ЗапросSQL, ПоляЗапроса, ВыборОднойСтроки", ЗапросSQL, ПоляЗапроса, ВыборОднойСтроки);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияФормыВыбораСтрок", ЭтотОбъект); 
	ОткрытьФорму("Документ.УстановкаСоответствий.Форма.Форма", ПараметрыФормы,ЭтотОбъект,,,,ОписаниеОповещения);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДопИнфо

&НаКлиенте
Процедура ДопИнформацияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанныеСоответствия = Элементы.Соответствия.ТекущиеДанные;
	ТекущиеДанныеДопИнфо = Элементы.ДопИнформация.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТекущиеДанныеСоответствия.КлючСвязи) Тогда
		ТекущиеДанныеСоответствия.КлючСвязи = ОбщегоНазначенияКлиентСервер.НовыйКлючСвязиСтрокиТаблицы(Объект.Соответствия);
	КонецЕсли;		
	
	Если НоваяСтрока Тогда		
		ТекущиеДанныеДопИнфо.КлючСвязи = ТекущиеДанныеСоответствия.КлючСвязи;
		УстановитьОтбор();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьЗапросКБазе(Команда)
    Если ЗначениеЗаполнено(Объект.СпособЗаполнения) Тогда	
		ВыполнитьЗапросКБазеНаСервере(); 
		Если Объект.Соответствия.Количество() > 0 Тогда
			Элементы.Соответствия.ТекущаяСтрока = 0;
		КонецЕсли;
		//УстановитьОтбор();
		
	Иначе
		Сообщить("Не выбран способ заполнения данных");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИзСпособаЗаполнения(Команда)
	ЗаполнитьИзСпособаЗаполненияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИзЭталона(Команда)
	ПолучитьИзЭталонаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЭлементамиПоУмолчанию(Команда)
	
	ЗаполнитьЭлементамиПоУмолчаниюНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЭлементом(Команда)
	
	ПараметрыФормы = Новый Структура("ТипЭталона", Объект.ТипЭталона);
	
	ОповещениеПриЗакрытии = Новый ОписаниеОповещения(
        "ОбработкаВыбораЭлементаДляЗаполнения",
        ЭтотОбъект);
	
	ОткрытьФорму("Документ.УстановкаСоответствий.Форма.ФормаВыбораЗначения", ПараметрыФормы, ЭтаФорма, , , , ОповещениеПриЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца); 
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьЭлементы(Команда)
	  ПодобратьЭталоныПоРеквизитам();
КонецПроцедуры

&НаКлиенте
Процедура ПодобратьПоЧастиСтроки(Команда)
	Если ЗначениеЗаполнено(Объект.ТипЭталона) Тогда			
		ПоискПоЧастиСтроки();     
	Иначе
		Сообщить("Не заполнен тип эталона");
	КонецЕсли; 
	
	
КонецПроцедуры   

&НаКлиенте
Процедура СоздатьЭталоны(Команда)
                         	
	СоздатьЭталоныНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзФайла(Команда)

	Если Не ЗначениеЗаполнено(Объект.ТипЭталона) Тогда
		Сообщить("Необходимо выбрать тип сопоставляемого эталона");
		Возврат;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.СпособЗаполнения) Тогда
		Сообщить("Не выбран способ заполнения данных");
		Возврат;
	КонецЕсли; 
	
	Если Не СпособЗаполненияПодходитДляЗагрузки(Объект.СпособЗаполнения) Тогда
		Сообщить("Выбранный способ заполнения не подходит для загрузки данных!");
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.База) Тогда
		Сообщить("Необходимо выбрать базу");
		Возврат;
	КонецЕсли; 
	
    ПараметрыЗагрузки = ЗагрузкаДанныхИзФайлаКлиент.ПараметрыЗагрузкиДанных();
    ПараметрыЗагрузки.ПолноеИмяТабличнойЧасти = "Документ.УстановкаСоответствий.Соответствия";
    ПараметрыЗагрузки.Заголовок = НСтр("ru = 'Загрузка данных из файла'");
    ДополнительныеПараметры = Новый Структура();
    ДополнительныеПараметры.Вставить("ТипЭталона", Объект.ТипЭталона);
	ДополнительныеПараметры.Вставить("СпособЗаполнения", Объект.СпособЗаполнения);
	ДополнительныеПараметры.Вставить("База", Объект.База);                        
	ДополнительныеПараметры.Вставить("АдресПараметрыЗапроса", АдресПараметрыЗапроса());  	


    ПараметрыЗагрузки.ДополнительныеПараметры = ДополнительныеПараметры;
    Оповещение = Новый ОписаниеОповещения("ЗагрузитьДанныеИзФайлаЗавершение", ЭтотОбъект);
    ЗагрузкаДанныхИзФайлаКлиент.ПоказатьФормуЗагрузки(ПараметрыЗагрузки, Оповещение);
    
КонецПроцедуры  

&НаКлиенте
Процедура ЗаполнитьПоПравилам(Команда)
	
	ЗаполнитьПоПравиламНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьРеквизитыИзСпособаЗаполнения(Команда)
	ПолучитьРеквизитыИзСпособаЗаполненияНаСервере();
КонецПроцедуры

//++ 16.05.2024 Корыткин Доработка из базы КФП заполнение конкретным эталоном в зависимости от определенных параметров
&НаКлиенте
Процедура ПроставитьЭталоныПоПараметруЭталон(Команда)
	ПроставитьЭталоныПоПараметруЭталонПослеНаСервере();
КонецПроцедуры
//--

&НаКлиенте
Процедура ПростойРежим(Команда)
	
	ПростойРежим = Не ПростойРежим;
	
	УстановитьВидимость();
	
КонецПроцедуры
//--

&НаКлиенте
Процедура СоздатьНаОсновании(Команда)  
	
	Если Модифицированность ИЛИ Объект.Ссылка.Пустая() Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ВопросПолучитьСписокЭталоновЗавершение", ЭтотОбъект);
		Текст = НСтр("ru='Документ не записан. Записать?'");
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(ОписаниеОповещения, Текст, Режим, 0, КодВозвратаДиалога.Да);
	Иначе
		ПолучитьОбработатьСписокЭталоновДляСозданияНаОсновании();
		
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьЗапросКБазеНаСервере()

	           
	
		Отказ = Ложь;	
		Ошибка = "";
		ДокОбъект = РеквизитФормыВЗначение("Объект");
		ДокОбъект.ЗаполнитьИзБазы(Отказ, Ошибка);
		ДокОбъект.ЗаполнитьСоответствияИзСправочника();
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");				
		
		Если Отказ Тогда
			Сообщить(Ошибка);
		КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Процедура СпособЗаполненияПриИзмененииНаСервере()
	
	ПриУстановкеСпособаЗаполнения();

	Если ЗначениеЗаполнено(Объект.СпособЗаполнения) Тогда
		
		ДокОбъект = РеквизитФормыВЗначение("Объект");
		ДокОбъект.ЗаполнитьПараметры();
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
						
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеПоТекущейСтроке() 
	
	 Если ПолучатьДопИнформацию Тогда
		ТекСтрока = Элементы.Соответствия.ТекущиеДанные; 
		
		Если ТекСтрока <> Неопределено И ЗначениеЗаполнено(Объект.ТаблицаИсточникДанных) Тогда
		
			Результат = ПолучитьДанныеНаСервере(Новый Структура("Источник, GUID, База",  Объект.ТаблицаИсточникДанных, ТекСтрока.ГУИДСправочника, Текстрока.База));
			
			ДопИнфо = "";
			
			Если ТипЗнч(Результат) = Тип("Массив") Тогда 
				
				Для каждого Данные из Результат Цикл
					
					Для каждого ЭлементСтруктуры из Данные Цикл
						
						ДопИнфо = ДопИнфо + ЭлементСтруктуры.Ключ + ": " + ЭлементСтруктуры.Значение + Символы.ПС;
						
					КонецЦикла;
					
				КонецЦикла;
				
			Иначе     
				ДопИнфо = Результат;
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	Элементы.ДопИнфо.Видимость = ПолучатьДопИнформацию;
	Элементы.Источник.Видимость = Ложь;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяПараметра", "НачалоПериода");
	
	
	Если Объект.Параметры.НайтиСтроки(Новый Структура("ИмяПараметра", "НачалоПериода")).Количество() <> 0
		ИЛИ  Объект.Параметры.НайтиСтроки(Новый Структура("ИмяПараметра", "Период")).Количество()
		Тогда
		Элементы.Период.Видимость = Истина;
	Иначе
		Элементы.Период.Видимость = Ложь;
	КонецЕсли;
		
	Если Объект.Параметры.НайтиСтроки(Новый Структура("ИмяПараметра", "База")).Количество() <> 0
		Тогда
		Элементы.База.Видимость = Истина;
		Элементы.СоответствияБаза.Видимость = Ложь;
	Иначе
		Элементы.База.Видимость = Ложь;
		Элементы.СоответствияБаза.Видимость = Истина;
	КонецЕсли; 
	
	Элементы.ФормаПростойРежим.Пометка = ПростойРежим;  
	
	Элементы.СпособЗаполнения.Видимость = Не ПростойРежим;
	Элементы.Параметры.Видимость = Не ПростойРежим;
	Элементы.Реквизиты.Видимость = Не ПростойРежим;
	Элементы.СоответствияГУИДСправочника.Видимость = Не ПростойРежим;
	Элементы.ДопИнформация.Видимость = Не ПростойРежим;
	Элементы.ПерезаполнятьВыбранные.Видимость = Не ПростойРежим;
	Элементы.ПерезаполнятьУтвержденные.Видимость = Не ПростойРежим;
	
	УстановитьВидимостьНаСервере();

КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ТипЭталона) Тогда
		
		Если Объект.ТипЭталона.ТипЗначения.СодержитТип(Тип("СправочникСсылка.ЗначенияЭталонов")) Тогда
			Элементы.СоответствияПодобратьПоЧастиСтроки.Видимость = Истина;
			Элементы.СоответствияЗаполнитьЭлементамиПоУмолчанию.Видимость = Истина;
		Иначе
			Элементы.СоответствияПодобратьПоЧастиСтроки.Видимость = Ложь;
			Элементы.СоответствияЗаполнитьЭлементамиПоУмолчанию.Видимость = Ложь;
    	КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметры()
	
	Для каждого Параметр из Объект.Параметры Цикл
		
		Если Параметр.ИмяПараметра = "НачалоПериода" Тогда
			Параметр.Значение = Объект.НачалоПериода;
		ИначеЕсли Параметр.ИмяПараметра = "КонецПериода" ИЛИ Параметр.ИмяПараметра = "Период" Тогда
			Параметр.Значение = Объект.КонецПериода;
		ИначеЕсли Параметр.ИмяПараметра = "База" Тогда
			Параметр.Значение = Строка(Объект.База);
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьДанныеНаСервере(Параметры)
	
	ОбработкаОбмена = Обработки.ОбменSQL.Создать();
	
	возврат ОбработкаОбмена.ПолучитьДанныеОбъекта(Параметры);
	
КонецФункции

&НаКлиенте
Процедура УстановитьОтбор()
    
    ТекДанные = Элементы.Соответствия.ТекущиеДанные;
    Если ТекДанные <> Неопределено Тогда
        Элементы.ДопИнформация.ОтборСтрок = Новый ФиксированнаяСтруктура("КлючСвязи", ТекДанные.КлючСвязи);
    КонецЕсли; 
        
КонецПроцедуры

&НаСервере
Процедура ПриУстановкеСпособаЗаполнения()
   Если ЗначениеЗаполнено(Объект.СпособЗаполнения) Тогда
		СписокВыбора = Объект.СпособЗаполнения.СтруктураПолей.ВыгрузитьКолонку("ИмяПоля");
		Элементы.РеквизитыРеквизитЗапроса.СписокВыбора.ЗагрузитьЗначения(СписокВыбора); 
		Если Объект.СпособЗаполнения = Справочники.СпособыПодбораЭталонов.ЗагрузкаИзФайла Тогда
		//	Элементы.СоответствияЗагрузитьДанные.Видимость = Истина;   
			Элементы.СоответствияВыполнитьЗапросКБазе.Видимость = Ложь;
			Элементы.Источник.Доступность = Истина;
		Иначе
		//	Элементы.СоответствияЗагрузитьДанные.Видимость = Ложь;     
			Элементы.СоответствияВыполнитьЗапросКБазе.Видимость = Истина;
			Элементы.Источник.Доступность = Ложь;
		КонецЕсли;                                                
	Иначе
		// Элементы.СоответствияЗагрузитьДанные.Видимость = Ложь;          
		Элементы.СоответствияВыполнитьЗапросКБазе.Видимость = Истина;
		Элементы.Источник.Доступность = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФлагЭталонПоУмолчанию();
	Если ТипЗнч(Объект.ТипЭталона) = Тип("СправочникСсылка.ЗначенияЭталонов") Тогда
		Для каждого СтрокаТЧ из Объект.Соответствия Цикл
			СтрокаТЧ.ЭталонПоУмолчанию = ?(ЗначениеЗаполнено(СтрокаТЧ.ЗначениеЭталона), СтрокаТЧ.ЗначениеЭталона.ЭталонПоУмолчанию, Ложь);		
		КонецЦикла;  
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзСпособаЗаполненияНаСервере()
   	
	Если ЗначениеЗаполнено(Объект.СпособЗаполнения) Тогда
		Объект.Параметры.Очистить();
		
		Для каждого Параметр из Объект.СпособЗаполнения.Параметры Цикл
			
			НовыйПараметр = Объект.Параметры.Добавить();
			ЗаполнитьЗначенияСвойств(НовыйПараметр, Параметр);
			Если Лев(Параметр.ТипПоля, 5) = "Число" Тогда
				НовыйПараметр.Значение = 0;
			ИначеЕсли  Лев(Параметр.ТипПоля, 4) = "Дата" Тогда
				НовыйПараметр.Значение = Дата(1, 1, 1, 0, 0, 0);
				Если НовыйПараметр.ИмяПараметра = "НачалоПериода" Тогда
					НовыйПараметр.Значение = Объект.НачалоПериода;
				ИначеЕсли НовыйПараметр.ИмяПараметра = "КонецПериода" 
					ИЛИ НовыйПараметр.ИмяПараметра = "Период"
					Тогда
					НовыйПараметр.Значение = Объект.КонецПериода; 
				КонецЕсли; 
			ИначеЕсли  Лев(Параметр.ТипПоля, 6) = "Булево" Тогда	
				НовыйПараметр.Значение = Ложь;
			Иначе
				НовыйПараметр.Значение = "";
			КонецЕсли;
			
		КонецЦикла;  
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПолучитьИзЭталонаНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ТипЭталона) Тогда
		
		Объект.Реквизиты.Очистить();
		Для каждого Реквизит из Объект.ТипЭталона.Реквизиты Цикл
		       НовыйРеквизит = Объект.Реквизиты.Добавить();
			   НовыйРеквизит.РеквизитЭталона = Реквизит.Реквизит;
			   		
		КонецЦикла;   
		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПериод()
	Объект.НачалоПериода = НачалоДня(Период.ДатаНачала);
	Объект.КонецПериода = КонецДня(Период.ДатаОкончания);
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьЭлементамиПоУмолчаниюНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ТипЭталона) Тогда  
		
		ДокОбъект = РеквизитФормыВЗначение("Объект");
		ДокОбъект.ПодобратьЭталоныПоУмолчанию();
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
		ЗаполнитьФлагЭталонПоУмолчанию();
	Иначе
		Сообщить("Не выбран тип эталона.");
	КонецЕсли;
		
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПодобратьЭталоныПоРеквизитам()
	 	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ПодобратьЭталоныПоРеквизитам(,,ПерезаполнятьУтвержденные, ПерезаполнятьВыбранные);
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	ЗаполнитьФлагЭталонПоУмолчанию();
КонецПроцедуры

&НаСервере
Процедура ПоискПоЧастиСтроки();

	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ПодобратьЭталоныПоЧастиСтроки(,,ПерезаполнятьУтвержденные, ПерезаполнятьВыбранные);
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");	
	ЗаполнитьФлагЭталонПоУмолчанию();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭталоныНаСервере()
	
	Ошибка = "";    
	Отказ = ЛожЬ;
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ПодобратьСоздатьЭталоныПоРеквизитам(Отказ, Ошибка);
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");                  
	Если Отказ Тогда
		Сообщить(Ошибка);
	Иначе
    	ЗаполнитьФлагЭталонПоУмолчанию(); 
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеИзФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныеПараметры) Экспорт
    
    Если АдресЗагруженныхДанных = Неопределено Тогда 
        Возврат;
    КонецЕсли;
    
    ЗагрузитьДанныеИзФайлаНаСервере(АдресЗагруженныхДанных);
КонецПроцедуры 

&НаСервере
Процедура ЗагрузитьДанныеИзФайлаНаСервере(АдресЗагруженныхДанных)
    
    ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
    
    ТоварыДобавлены = Ложь;
    Для каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл 
        
        Если Не ЗначениеЗаполнено(СтрокаТаблицы.ГУИДСПравочника) Тогда 
            Продолжить;
        КонецЕсли;
        
        НоваяСтрокаДанные = Объект.Соответствия.Добавить();
        НоваяСтрокаДанные.База = СтрокаТаблицы.База;
        НоваяСтрокаДанные.ГУИДСПравочника = СтрокаТаблицы.ГУИДСПравочника;
        НоваяСтрокаДанные.ЗначениеЭталона = СтрокаТаблицы.ЗначениеЭталона;
		НоваяСтрокаДанные.Представление = СтрокаТаблицы.Представление;
		НоваяСтрокаДанные.Статус = ?(ЗначениеЗаполнено(НоваяСтрокаДанные.ЗначениеЭталона), "Загружен", "Не выбран");
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРеквизит(Ссылка, НазваниеРеквизита) 
	
	возврат Общегоназначения.ЗначениеРеквизитаОбъекта(Ссылка, НазваниеРеквизита);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоПравиламНаСервере()
		
	Если Объект.СпособЗаполнения.ПравилаУстановкиЗначений.Количество() <> 0	Тогда
		ДокОбъект = РеквизитФормыВЗначение("Объект");
		ДокОбъект.ПодобратьЭталоныПоПравилам(,,ПерезаполнятьУтвержденные, ПерезаполнятьВыбранные);
		ЗначениеВРеквизитФормы(ДокОбъект, "Объект"); 
		ЗаполнитьФлагЭталонПоУмолчанию();
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПолучитьРеквизитыИзСпособаЗаполненияНаСервере()
	
	Если ЗначениеЗаполнено(Объект.СпособЗаполнения) Тогда
		Объект.Реквизиты.Очистить();
		Для каждого Реквизит из Объект.СпособЗаполнения.СтруктураПолей Цикл
		       НовыйРеквизит = Объект.Реквизиты.Добавить();
			   НовыйРеквизит.РеквизитЭталона = Реквизит.РеквизитЭталона;
			   НовыйРеквизит.РеквизитЗапроса = Реквизит.ИмяПоля;
			   НовыйРеквизит.Поиск = Реквизит.Поиск; 		   		
		КонецЦикла;  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбУдалении(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда 
		Параметры.СтрокаДокумента.Удалить = Ложь;
        Возврат;
    КонецЕсли;

    //...


КонецПроцедуры      

//++ 16.05.2024 Корыткин А.А. Доработка из КФП подстановка эталонов по параметрам
&НаСервере
Процедура ПроставитьЭталоныПоПараметруЭталонПослеНаСервере()
	Ошибка = "";    
	Отказ = ЛожЬ;
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ПодобратьЗаполнитьЭлементыПоЗначению(Отказ, Ошибка, ПерезаполнятьВыбранные, ПерезаполнятьУтвержденные);
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");                  
	Если Отказ Тогда
		Сообщить(Ошибка);
	Иначе
    	ЗаполнитьФлагЭталонПоУмолчанию(); 
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ВыбранПланСчетов(ТипЭталона)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипЭталона, "ПланСчетов");	

КонецФункции

&НаСервереБезКонтекста
Функция ВыбранСпособЗаполненияПланаСчетов(СпособЗаполнения) 
		
	Запрос = Новый Запрос;

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СпособыПодбораЭталонов.ТипЭталона.ПланСчетов, ЛОЖЬ) КАК ЭтоПланСчетов
		|ИЗ
		|	Справочник.СпособыПодбораЭталонов КАК СпособыПодбораЭталонов
		|ГДЕ
		|	СпособыПодбораЭталонов.Ссылка = &Ссылка"; 
	Запрос.УстановитьПараметр("Ссылка", СпособЗаполнения);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ЭтоПланСчетов;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

//++ 31.03.2025 Муравьев Д.О.
&НаСервере
Функция ПолучитьЗапросSQL()
	Текст = Объект.СпособЗаполнения.ТекстЗапроса;      
	
	Для каждого ПараметрЗапроса из Объект.Параметры Цикл
		
		Если ТипЗнч(ПараметрЗапроса.Значение) = Тип("Дата") Тогда
			ЗначениеПараметра = "'" + Формат(ПараметрЗапроса.Значение, "ДФ='yyyy-MM-dd'") + "'";
		ИначеЕсли ТипЗнч(ПараметрЗапроса.Значение) = Тип("Число") Тогда
			ЗначениеПараметра = Формат(ПараметрЗапроса.Значение, "ЧГ=");
		ИначеЕсли ТипЗнч(ПараметрЗапроса.Значение) = Тип("Булево") Тогда
			ЗначениеПараметра = ?(ПараметрЗапроса.Значение, 1, 0)
		Иначе
		    ЗначениеПараметра = "'" +СокрЛП(ПараметрЗапроса.Значение) + "'";  
		КонецЕсли;		
		
		Текст = СтрЗаменить(Текст, "&"+ПараметрЗапроса.ИмяПараметра, ЗначениеПараметра);	
		
		
	КонецЦикла;
	Возврат Текст;	

	
КонецФункции 

&НаСервере
Функция ПолучитьПоляЗапроса()
	ПоляЗапроса = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпособыПодбораЭталоновСтруктураПолей.ИмяПоля КАК ИмяПоля
		|ИЗ
		|	Справочник.СпособыПодбораЭталонов.СтруктураПолей КАК СпособыПодбораЭталоновСтруктураПолей
		|ГДЕ
		|	СпособыПодбораЭталоновСтруктураПолей.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.СпособЗаполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ПоляЗапроса = ПоляЗапроса + " " +ВыборкаДетальныеЗаписи.ИмяПоля + ",";
		
	КонецЦикла;
	
    ПоляЗапроса = Лев(ПоляЗапроса, СтрДлина(ПоляЗапроса) - 1);
	Возврат ПоляЗапроса;	
КонецФункции

&НаСервере
Процедура ВыполнитьПослеЗакрытияФормыВыбораСтрок(РезультатЗакрытия, ПараметрыОповещения) Экспорт
	//++ 08.04.2025 Муравьев Д.О.
	Если РезультатЗакрытия <> Неопределено Тогда
		Если НЕ РезультатЗакрытия.Свойство("ВыборОднойСтроки") тогда
			ДобавитьСтрокиИзПодбора(РезультатЗакрытия.Адрес); 
		Иначе
			ИзменитьСтроку(РезультатЗакрытия.Адрес)
		КонецЕсли;
	КонецЕсли;
	//-- 08.04.2025 Муравьев Д.О.
КонецПроцедуры                
    
&НаСервере
Процедура ДобавитьСтрокиИзПодбора(Адрес)
	ТаблицаСтрок = ПолучитьИзВременногоХранилища(Адрес); 
	ТекущийКлючСвязи = ПолучитьМаксимальныйКлючСвязи() + 1;
	КолонкиТЗ = ТаблицаСтрок.Колонки;
	Для Каждого стр из ТаблицаСтрок Цикл
		СтрокаТабличнойЧасти = Объект.Соответствия.Добавить();
		СтрокаТабличнойЧасти.ГУИДСправочника = стр.GUID;
		//СтрокаТабличнойЧасти.Представление = стр.Name;
		СтрокаТабличнойЧасти.База = Объект.База;
		СтрокаТабличнойЧасти.КлючСвязи = ТекущийКлючСвязи;
		
		Для каждого Поле из Объект.СпособЗаполнения.СтруктураПолей Цикл
				
				Если КолонкиТЗ.Найти(Поле.ИмяПоля) <> Неопределено Тогда
					
					Если Поле.ОсновноеПредставление Тогда
						СтрокаТабличнойЧасти.Представление = стр[Поле.ИмяПоля];
					КонецЕсли;
					
					НоваяСтрокаДопИнфо = Объект.ДопИнформация.Добавить(); 
					НоваяСтрокаДопИнфо.ИмяПоля = Поле.ИмяПоля;
					НоваяСтрокаДопИнфо.ЗначениеПоля = стр[Поле.ИмяПоля]; 
					НоваяСтрокаДопИнфо.КлючСвязи = ТекущийКлючСвязи;						
					
				КонецЕсли;	
				
			КонецЦикла;
			ТекущийКлючСвязи = ТекущийКлючСвязи + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьМаксимальныйКлючСвязи()
	
МаксЗначение = 0;
	для каждого СтрокаТЧ из Объект.Соответствия цикл
		МаксЗначение = Макс(МаксЗначение, СтрокаТЧ.КлючСвязи); 
	конеццикла;
	Возврат МаксЗначение;	
КонецФункции
//-- 31.03.2025 Муравьев Д.О.

Процедура ИзменитьСтроку(Адрес) //-- 08.04.2025 Муравьев Д.О.
	ТаблицаСтрок = ПолучитьИзВременногоХранилища(Адрес); 
	//ТекущийКлючСвязи = ПолучитьМаксимальныйКлючСвязи() + 1;
	стр = ТаблицаСтрок[0];
	КолонкиТЗ = ТаблицаСтрок.Колонки;
	СтрокаТабличнойЧасти = Объект.Соответствия[Элементы.Соответствия.ТекущаяСтрока];
	ТекущийКлючСвязи = СтрокаТабличнойЧасти.КлючСвязи;

	//СтрокаТабличнойЧасти = Объект.Соответствия.Добавить();
	СтрокаТабличнойЧасти.ГУИДСправочника = стр.GUID;
	//СтрокаТабличнойЧасти.Представление = стр.Name;
	СтрокаТабличнойЧасти.База = Объект.База;
	//СтрокаТабличнойЧасти.КлючСвязи = ТекущийКлючСвязи;
	
	Для каждого Поле из Объект.СпособЗаполнения.СтруктураПолей Цикл
		
		Если КолонкиТЗ.Найти(Поле.ИмяПоля) <> Неопределено Тогда
			
			Если Поле.ОсновноеПредставление Тогда
				СтрокаТабличнойЧасти.Представление = стр[Поле.ИмяПоля];
			КонецЕсли;
			Отбор = Новый Структура;
			Отбор.Вставить("КлючСвязи",ТекущийКлючСвязи);
			НоваяСтрокаДопИнфо = Объект.ДопИнформация.НайтиСтроки(Отбор); 
			НоваяСтрокаДопИнфо[0].ИмяПоля = Поле.ИмяПоля;
			НоваяСтрокаДопИнфо[0].ЗначениеПоля = стр[Поле.ИмяПоля]; 
			НоваяСтрокаДопИнфо[0].КлючСвязи = ТекущийКлючСвязи;						
			
		КонецЕсли;	
		
	КонецЦикла;
	ТекущийКлючСвязи = ТекущийКлючСвязи + 1;
	
	
КонецПроцедуры

&НаСервере
Процедура ТипЭталонаПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Объект.СпособЗаполнения = Справочники.СпособыПодбораЭталонов.СпособЗаполненияПоУмолчанию(Объект.ТипЭталона);
	
	Если Не ЗначениеЗаполнено(Объект.СпособЗаполнения) Тогда
		Сообщить("Для данного типа эталонов не установлен способ заполнения по умолчанию. Отключите простой режим для выбора способа заполнения вручную.");
	КонецЕсли;
	
	СпособЗаполненияПриИзмененииНаСервере();
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораЭлементаДляЗаполнения(Результат, ДополнительныеПараметры) Экспорт
   
    Если Результат <> Неопределено Тогда
       Для каждого СтрокаТЧ из Объект.Соответствия Цикл
				
		   Если Не ЗначениеЗаполнено(СтрокаТЧ.ЗначениеЭталона) ИЛИ (ПерезаполнятьВыбранные И НЕ СтрокаТЧ.Статус = "Утвержден") 
			   ИЛИ (ПерезаполнятьУтвержденные И СтрокаТЧ.Статус = "Утвержден") Тогда
					
				СтрокаТЧ.ЗначениеЭталона = Результат;
				СтрокаТЧ.Статус = "Выбран";
					
			КонецЕсли;
				
		КонецЦикла;	
    КонецЕсли;
КонецПроцедуры

&НаСервере 
Процедура УстановитьЗаголовкиКолонок()
	Если ЗначениеЗаполнено(Объект.ТипЭталона) Тогда      
		
		ЗаголовокКолонки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ТипЭталона, "Заголовок");
		Если ЗначениеЗаполнено(ЗаголовокКолонки) Тогда
			Элементы.СоответствияЗначениеЭталона.Заголовок = ЗаголовокКолонки;
		Иначе
			Элементы.СоответствияЗначениеЭталона.Заголовок = "Эталон";
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СпособЗаполнения) Тогда
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпособыПодбораЭталоновСтруктураПолей.Синоним КАК Синоним
		|ИЗ
		|	Справочник.СпособыПодбораЭталонов.СтруктураПолей КАК СпособыПодбораЭталоновСтруктураПолей
		|ГДЕ
		|	СпособыПодбораЭталоновСтруктураПолей.Ссылка = &Ссылка
		|	И СпособыПодбораЭталоновСтруктураПолей.ОсновноеПредставление";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.СпособЗаполнения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Элементы.СоответствияПредставление.Заголовок = Выборка.Синоним;
	КонецЕсли;
	
	
		
	КонецЕсли;
		
КонецПроцедуры


&НаСервере
Функция СпособЗаполненияПодходитДляЗагрузки(СпособЗаполнения)
	
	  Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СпособЗаполнения, "ДляЗагрузкиДанных");
	
  КонецФункции  
  
&НаСервере
Функция АдресПараметрыЗапроса()
	  
	  Возврат ПоместитьВоВременноеХранилище(Объект.Параметры.Выгрузить(), ЭтаФорма.УникальныйИдентификатор); 
	  
КонецФункции

&НаСервере
Функция СписокЭталоновНаОсновании()
	// Вставить содержимое обработчика.
	
	МассивСоответствий = Новый Массив;

	    Если НЕ ЗначениеЗаполнено(Объект.ТипЭталона) Тогда
        Сообщить("Тип эталона не указан. Создание на основании не возможно!", СтатусСообщения.Важное);
        Возврат МассивСоответствий;
    КонецЕсли;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    ТипыЭталонов.Ссылка КАК ТипЭталона,
        |    ТипыЭталонов.ТипЗначения,
        |    ТипыЭталонов.Реквизиты.(
        |        Реквизит,
        |        Реквизит.ТипЗначения КАК ТипЗначенияРеквизита
        |    ) КАК Реквизиты
        |ИЗ
        |    ПланВидовХарактеристик.ТипыЭталонов КАК ТипыЭталонов";
    
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();   
		    
   
    ТекущиеРеквизиты = Новый Массив;
    
    Пока Выборка.Следующий() Цикл
        Если Выборка.ТипЭталона = Объект.ТипЭталона Тогда
            ВыборкаРеквизиты = Выборка.Реквизиты.Выбрать();
            Пока ВыборкаРеквизиты.Следующий() Цикл
                СтруктураРеквизита = Новый Структура;
                СтруктураРеквизита.Вставить("Реквизит", ВыборкаРеквизиты.Реквизит);
                СтруктураРеквизита.Вставить("Типы", ВыборкаРеквизиты.ТипЗначенияРеквизита.Типы());
                ТекущиеРеквизиты.Добавить(СтруктураРеквизита);
            КонецЦикла;
            Прервать;
        КонецЕсли;
    КонецЦикла;
    
    // Если у текущего ТипЭталона нет реквизитов, выходим
    Если ТекущиеРеквизиты.Количество() = 0 Тогда
        Сообщить("У указанного типа эталона нет реквизитов.", СтатусСообщения.Информация);
        Возврат МассивСоответствий;
    КонецЕсли;
    
    // Сбрасываем выборку для проверки других ТиповЭталонов
    Выборка.Сбросить();
    
    // Проверяем типы значений других ТиповЭталонов
    Пока Выборка.Следующий() Цикл
        // Пропускаем текущий ТипЭталона
        Если Выборка.ТипЭталона = Объект.ТипЭталона Тогда
            Продолжить;
        КонецЕсли;
        
        // Получаем типы значения текущего другого ТипЭталона
        ТипыДругогоЭталона = Выборка.ТипЗначения.Типы();
        
        // Проверяем каждый реквизит текущего ТипЭталона
        Для Каждого ТекущийРеквизит Из ТекущиеРеквизиты Цикл
            Для Каждого ТипРеквизита Из ТекущийРеквизит.Типы Цикл
                // Проверяем совпадение с типами другого ТипЭталона
                Если ТипыДругогоЭталона.Найти(ТипРеквизита) <> Неопределено Тогда
                    // Найдено совпадение, добавляем в массив
                    СтруктураСоответствия = Новый Структура;
                    СтруктураСоответствия.Вставить("ТипЭталона", Выборка.ТипЭталона);
                    СтруктураСоответствия.Вставить("Реквизит", ТекущийРеквизит.Реквизит);
                    МассивСоответствий.Добавить(СтруктураСоответствия);
                КонецЕсли;
            КонецЦикла;
        КонецЦикла;
    КонецЦикла; 
	
	Возврат МассивСоответствий;
    
КонецФункции



&НаКлиенте
Процедура ПослеВыбораЭлемента(ВыбранныйЭлемент, СписокПараметров) Экспорт
    Если ВыбранныйЭлемент = Неопределено Тогда
        Сообщить("Не выбран тип создаваемого эталона.");
    Иначе
       	СоздатьДокументНаОсновании(ВыбранныйЭлемент.Значение.ТипЭталона, ВыбранныйЭлемент.Значение.Реквизит)
    КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СоздатьДокументНаОсновании(ТипЭталона, Реквизит)
	
	ПараметрыЗаполнения = Новый Структура;
    ПараметрыЗаполнения.Вставить("ТипЭталона", ТипЭталона); 
	ПараметрыЗаполнения.Вставить("Реквизит", Реквизит);  
	ПараметрыЗаполнения.Вставить("База", Объект.База);

    ПараметрыЗаполнения.Вставить("Основание", Объект.Ссылка); 
	
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("ЗначенияЗаполнения", ПараметрыЗаполнения);
    
    ОткрытьФорму("Документ.УстановкаСоответствий.ФормаОбъекта", ПараметрыФормы);	
	
КонецПроцедуры 

&НаКлиенте
Процедура ПолучитьОбработатьСписокЭталоновДляСозданияНаОсновании();
	
	МассивСоответствий = СписокЭталоновНаОсновании(); 
	
	// Обработка результатов
	Если МассивСоответствий.Количество() = 0 Тогда
	    Сообщить("Нет подходящих типов эталонов для создания на основании", СтатусСообщения.Информация);
	    Возврат;
	ИначеЕсли МассивСоответствий.Количество() = 1 Тогда
		СоздатьДокументНаОсновании(МассивСоответствий[0].ТипЭталона, МассивСоответствий[0].Реквизит);		
	Иначе
	    // Если найдено несколько структур, показываем пользователю выбор
	    СписокВыбора = Новый СписокЗначений;
	    Для Каждого Соответствие Из МассивСоответствий Цикл
	        Представление = СтрШаблон("Тип: %1, Реквизит: %2", 
	          Соответствие.ТипЭталона, Соответствие.Реквизит);
	        СписокВыбора.Добавить(Соответствие, Представление);
	    КонецЦикла;		
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораЭлемента", ЭтотОбъект);
		СписокВыбора.ПоказатьВыборЭлемента(Оповещение, "Выберите тип эталона для создания на основании.");
		//...
     КонецЕсли

 КонецПроцедуры 
 
 &НаКлиенте
Процедура ВопросПолучитьСписокЭталоновЗавершение(Ответ, ДополнительныеПараметры) Экспорт 
	
	Если Ответ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ЭтотОбъект.Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
		ПолучитьОбработатьСписокЭталоновДляСозданияНаОсновании();
		
	Иначе
		
		 ПолучитьОбработатьСписокЭталоновДляСозданияНаОсновании(); 		
	 КонецЕсли;
КонецПроцедуры
#КонецОбласти
